# Homebrew Cask List
# Source: Common macOS GUI applications
# One package per line, comments start with #

# Terminal
ghostty
iterm2
warp

# Editors & IDEs
visual-studio-code
cursor
positron
rstudio

# Browsers
firefox
brave-browser
google-chrome

# Communication
slack
zoom
discord

# AI
claude
chatgpt

# Productivity
obsidian
notion
spotify
google-drive

# Development
docker
docker-desktop
github
responsively
cmux

# Utilities - Window & Menu Bar
rectangle
raycast
hiddenbar
caffeine
clop
maccy
appcleaner
