# Flatpak Post-Install Package List
# Source: src/platforms/linux/post_install.sh
# One package per line, comments start with #
# All IDs use full reverse-DNS format (required by flatpak install)

# System - Password Manager
com.bitwarden.desktop

# System - Permissions Manager
com.github.tchx84.Flatseal

# System - FTP/SQL Manager
org.filezillaproject.Filezilla

# System - GPU Info
io.github.arunsivaramanneo.GPUViewer

# System - Secure File Transfer
org.onionshare.OnionShare

# System - Virtualization
org.gnome.Boxes

# System - BitTorrent
de.haeckerfelix.Fragments

# System - Metadata Cleaner
fr.romainvigier.MetadataCleaner

# Sound - Volume Control
org.pulseaudio.pavucontrol

# Sound - Music Streaming
com.spotify.Client

# Sound - Audio Editor
org.audacityteam.Audacity

# Sound - Song Discovery
io.github.seadve.Mousai

# Image - GIF Creator
com.uploadedlobster.peek

# Image - Vector Graphics
org.inkscape.Inkscape

# Video - Editor
org.kde.kdenlive

# Video - Streaming
com.obsproject.Studio

# Video - Media Player
org.videolan.VLC

# Video - 3D Animation
org.blender.Blender

# Games
com.valvesoftware.Steam

# Communication - Video Conferencing
us.zoom.Zoom

# Communication - Team Chat
com.slack.Slack

# Communication - Messaging
org.telegram.desktop
com.discordapp.Discord

# Productivity - Browsers
com.google.Chrome
org.chromium.Chromium
io.gitlab.librewolf-community

# Productivity - Cloud Storage
com.dropbox.Client
nz.mega.MEGAsync

# Productivity - PDF/Documents
org.kde.okular
com.calibre_ebook.calibre
ch.openboard.OpenBoard
com.github.johnfactotum.Foliate

# Productivity - Design/Fonts
io.github.mmstick.FontFinder
org.gustavoperedo.FontDownloader
io.github.lainsce.Colorway
io.github.lainsce.Emulsion

# Productivity - Development
com.visualstudio.code
rest.insomnia.Insomnia
org.gnome.meld

# Productivity - Time Management
# TogglDesktop (com.toggl.TogglDesktop) removed -- discontinued, 404 on Flathub
# Workflow (com.gitlab.cunidev.Workflow) removed -- archived Dec 2023, 404 on Flathub

# Productivity - Writing
org.texstudio.TeXstudio

# Productivity - Focus/Audio
com.rafaelmardojai.Blanket

# Productivity - File Organization
org.librehunt.Organizer

# Research - Note Taking
md.obsidian.Obsidian

# Research - References
org.zotero.Zotero

# Research - 3D Viewer
org.pymol.PyMOL

# Research - Statistics
org.jaspstats.JASP

# Research - Mathematics
org.geogebra.GeoGebra
