# Flatpak Package List
# Source: platforms/linux/auto/auto_flat.sh
# One package per line, comments start with #
# All IDs use full reverse-DNS format (required by flatpak install)

# System
com.github.tchx84.Flatseal
org.filezillaproject.Filezilla
org.gnome.Boxes

# Terminal
org.vim.Vim

# Sound
org.pulseaudio.pavucontrol

# Video
com.obsproject.Studio
org.blender.Blender
org.videolan.VLC
us.zoom.Zoom

# Communication
com.slack.Slack
# Skype (com.skype.Client) removed -- archived on Flathub July 2025

# Productivity - File Management
com.dropbox.Client

# Productivity - Documents
net.code_industry.MasterPDFEditor
com.wps.Office
com.calibre_ebook.calibre

# Productivity - Learning
net.ankiweb.Anki
org.geogebra.GeoGebra
ch.openboard.OpenBoard

# Productivity - Utilities
com.rafaelmardojai.Blanket
org.librehunt.Organizer
org.gnome.meld
com.axosoft.GitKraken

# Productivity - Stats
org.jamovi.jamovi

# Browser
org.gnome.Epiphany
